<?php

namespace NumberToWords\NumberTransformer;

class GreekNumberTransformerTest extends NumberTransformerTest
{
    protected function setUp(): void
    {
        $this->numberTransformer = new GreekNumberTransformer();
    }

    public function providerItConvertsNumbersToWords(): array
    {
        return [
            [0, 'μηδέν'],
            [1, 'ένα'],
            [9, 'εννέα'],
            [10, 'δέκα'],
            [11, 'έντεκα'],
            [19, 'δεκα­εννέα'],
            [20, 'είκοσι'],
            [21, 'είκοσι ένα'],
            [90, 'εννενήντα'],
            [99, 'εννενήντα εννέα'],
            [100, ''],
            [101, ''],
            [111, ''],
            [120, ''],
            [121, ''],
            [900, ''],
            [909, ''],
            [919, ''],
            [990, ''],
            [999, ''],
            [1000, ''],
            [2000, ''],
            [4000, ''],
            [5000, 'п\'ять тисяч'],
            [11000, 'одинадцять тисяч'],
            [21000, 'двадцять одна тисяча'],
            [999000, 'дев\'ятсот дев\'яносто дев\'ять тисяч'],
            [999999, 'дев\'ятсот дев\'яносто дев\'ять тисяч дев\'ятсот дев\'яносто дев\'ять'],
            [1000000, 'один мільйон'],
            [1001001, 'один мільйон'],
            [2000000, 'два мільйони'],
            [4000000, 'чотири мільйони'],
            [5000000, 'п\'ять мільйонів'],
            [999000000, 'дев\'ятсот дев\'яносто дев\'ять мільйонів'],
            [999000999, 'дев\'ятсот дев\'яносто дев\'ять мільйонів дев\'ятсот дев\'яносто дев\'ять'],
            [999999000, 'дев\'ятсот дев\'яносто дев\'ять мільйонів дев\'ятсот дев\'яносто дев\'ять тисяч'],
            [999999999, 'дев\'ятсот дев\'яносто дев\'ять мільйонів дев\'ятсот дев\'яносто дев\'ять тисяч дев\'ятсот дев\'яносто дев\'ять'],
            [1174315110, 'один мільярд сто сімдесят чотири мільйони триста п\'ятнадцять тисяч сто десять'],
            [1174315119, 'один мільярд сто сімдесят чотири мільйони триста п\'ятнадцять тисяч сто дев\'ятнадцять'],
            [15174315110, 'п\'ятнадцять мільярдів сто сімдесят чотири мільйони триста п\'ятнадцять тисяч сто десять'],
            [35174315119, 'тридцять п\'ять мільярдів сто сімдесят чотири мільйони триста п\'ятнадцять тисяч сто дев\'ятнадцять'],
            [935174315119, 'дев\'ятсот тридцять п\'ять мільярдів сто сімдесят чотири мільйони триста п\'ятнадцять тисяч сто дев\'ятнадцять'],
            [2935174315119, 'два трильйони дев\'ятсот тридцять п\'ять мільярдів сто сімдесят чотири мільйони триста п\'ятнадцять тисяч сто дев\'ятнадцять'],
        ];
    }
}
