<?php

namespace NumberToWords\NumberTransformer;

class GreekNumberTransformerTest extends NumberTransformerTest
{
    protected function setUp(): void
    {
        $this->numberTransformer = new GreekNumberTransformer();
    }

    public function providerItConvertsNumbersToWords(): array
    {
        return [
            [0, 'μηδέν'],
            [1, 'ένα'],
            [9, 'εννέα'],
            [10, 'δέκα'],
            [11, 'έντεκα'],
            [19, 'δεκαεννέα'],
            [20, 'είκοσι'],
            [21, 'είκοσι ένα'],
            [90, 'εννενήντα'],
            [99, 'εννενήντα εννέα'],
            [100, 'εκατό'],
            [101, 'εκατόν ένα'],
            [111, 'εκατόν έντεκα'],
            [120, 'εκατόν είκοσι'],
            [121, 'εκατόν είκοσι ένα'],
            [222, 'διακόσια είκοσι δύο'],
            [375, 'τριακόσια εβδομήντα πέντε'],
            [371, 'τριακόσια εβδομήντα ένα'],
            [555, 'πεντακόσια πενήντα πέντε'],
            [550, 'πεντακόσια πενήντα'],
            [500, 'πεντακόσια'],
            [900, 'εννιακόσια'],
            [909, 'εννιακόσια εννέα'],
            [919, 'εννιακόσια δεκαεννέα'],
            [990, 'εννιακόσια εννενήντα'],
            [999, 'εννιακόσια εννενήντα εννέα'],
            [1000, 'χίλια'],
            [2000, 'δύο χίλιάδες'],
            [4000, 'τέσσερις χίλιάδες'],
            [5000, 'πέντε χίλιάδες'],
            [11000, 'έντεκα χίλιάδες'],
            [111111, 'εκατόν έντεκα χίλιάδες εκατόν έντεκα'],
            [21000, 'είκοσι μία χίλιάδες'],
            [51000, 'πενήντα μία χίλιάδες'],
            [11134, 'έντεκα χίλιάδες εκατόν τριάντα τέσσερα'],
            [21134, 'είκοσι μία χίλιάδες εκατόν τριάντα τέσσερα'],
            [999000, 'εννιακόσιες εννενήντα εννέα χίλιάδες'],
            [999999, 'εννιακόσιες εννενήντα εννέα χίλιάδες εννιακόσια εννενήντα εννέα'],
            [555555, 'πεντακόσιες πενήντα πέντε χίλιάδες πεντακόσια πενήντα πέντε'],
            [1000000, 'ένα εκατομμύριο'],
            [1001001, 'ένα εκατομμύριο χίλια ένα'],
            [2000000, 'δύο εκατομμύρια'],
            [4000000, 'τέσσερα εκατομμύρια'],
            [5000000, 'πέντε εκατομμύρια'],
            [999000000, 'εννιακόσια εννενήντα εννέα εκατομμύρια'],
            [999000999, 'εννιακόσια εννενήντα εννέα εκατομμύρια εννιακόσια εννενήντα εννέα'],
            [999999000, 'εννιακόσια εννενήντα εννέα εκατομμύρια εννιακόσιες εννενήντα εννέα χίλιάδες'],
            [999999999, 'εννιακόσια εννενήντα εννέα εκατομμύρια εννιακόσιες εννενήντα εννέα χίλιάδες εννιακόσια εννενήντα εννέα'],
            [1174315110, 'ένα δισεκατομμύριο εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δέκα'],
            [1174315119, 'ένα δισεκατομμύριο εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δεκαεννέα'],
            [15174315110, 'δεκαπέντε δισεκατομμύρια εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δέκα'],
            [35174315119, 'τριάντα πέντε δισεκατομμύρια εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δεκαεννέα'],
            [935174315119, 'εννιακόσια τριάντα πέντε δισεκατομμύρια εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δεκαεννέα'],
            [2935174315119, 'δύο τρισεκατομμύρια εννιακόσια τριάντα πέντε δισεκατομμύρια εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δεκαεννέα'],
            [5174315119, 'πέντε δισεκατομμύρια εκατόν εβδομήντα τέσσερα εκατομμύρια τριακόσιες δεκαπέντε χίλιάδες εκατόν δεκαεννέα'],
            [999999999999, 'εννιακόσια εννενήντα εννέα δισεκατομμύρια εννιακόσια εννενήντα εννέα εκατομμύρια εννιακόσιες εννενήντα εννέα χίλιάδες εννιακόσια εννενήντα εννέα'],
            [111111111111, 'εκατόν έντεκα δισεκατομμύρια εκατόν έντεκα εκατομμύρια εκατόν έντεκα χίλιάδες εκατόν έντεκα']
        ];
    }
}
